org/recipes/chickpea-carrot-patties.org
#+TITLE: Chickpea Carrot Patties
#+DATE: 2018-08-18
#+SETUPFILE: ../recipe.setup

* Ingredients
  - 1 carrot
  - 1 clove garlic
  - 1 can chickpeas
  - 1.5 tsp ground cumin
  - 1.5 tsp parsley
  - Salt + pepper
  - 1 large egg (or aquafaba)
  - 2 tbsp plain flour

* Instructions
  1. Grate carrot coarsely and put aside
  2. Combine chickpeas, garlic, spices on food processor. Slightly process into rough paste
  3. Add carrot, egg, flour. Process until blended, but rugged
  4. Fry 2-3 minutes each side

