recipes/chickpea-carrot-patties.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chickpea Carrot Patties</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Chickpea Carrot Patties</h1>

<div id="outline-container-orgec7ed27" class="outline-2">
<h2 id="orgec7ed27">Ingredients</h2>
<div class="outline-text-2" id="text-orgec7ed27">
<ul class="org-ul">
<li>1 carrot</li>
<li>1 clove garlic</li>
<li>1 can chickpeas</li>
<li>1.5 tsp ground cumin</li>
<li>1.5 tsp parsley</li>
<li>Salt + pepper</li>
<li>1 large egg (or aquafaba)</li>
<li>2 tbsp plain flour</li>
</ul>
</div>
</div>

<div id="outline-container-org4fbbab5" class="outline-2">
<h2 id="org4fbbab5">Method</h2>
<div class="outline-text-2" id="text-org4fbbab5">
<ol class="org-ol">
<li>Grate carrot coarsely and put aside</li>
<li>Combine chickpeas, garlic, spices on food processor. Slightly process into rough paste</li>
<li>Add carrot, egg, flour. Process until blended, but rugged</li>
<li>Fry 2-3 minutes each side</li>
</ol>
</div>
</div>
</div>
</body>
</html>
